import type {EditorialTeam} from "@/models/editors"

export const editors: EditorialTeam = {
    chiefEditors: [
        {
        name: "В.В. Сильянов",
        degree: "д-р техн. наук",
        title: "профессор",
        affiliation: "главный редактор"
        }
    ],
    editorialCouncil: [
        {
            name: "В.Н. Бойков",
            degree: "д-р техн. наук",
            title: "профессор",
        },
        {
            name: "Ю.З. Васильев",
            degree: "д-р техн. наук",
            title: "профессор",
        },
        {
            name: "А.В. Бусел",
            degree: "д-р техн. наук",
            title: "профессор Белоруссии",
        },
        {
            name: "М.Г. Горячев",
            degree: "д-р техн. наук",
            title: "профессор",
        },
        {
            name: "В.В. Дементиенко",
            degree: "д-р техн. наук",
            title: "профессор",
        },
        {
            name: "И.В. Дембьянушко",
            degree: "д-р техн. наук",
            title: "профессор",
        },
        {
            name: "С.В. Жанказиев",
            degree: "д-р техн. наук",
            title: "профессор",
        },
        {
            name: "В.А. Зорин",
            degree: "д-р техн. наук",
            title: "профессор",
        },
        {
            name: "А.М. Иванов",
            degree: "д-р техн. наук",
            title: "профессор",
        },
        {
            name: "Б.Б. Каримов",
            degree: "д-р техн. наук",
            title: "профессор",
            affiliation: "МСД",
        },
        {
            name: "А.В. Корочкин",
            degree: "канд. техн. наук",
            title: "зав. главного редактора",
        },
        {
            name: "В.Ф. Липская",
            title: "зам. главного редактора",
        },
        {
            name: "Т.Ы. Маткермимов",
            degree: "д-р техн. наук",
            title: "профессор Кыргызстана",
        },
        {
            name: "П.И. Поспелов",
            degree: "д-р техн. наук",
            title: "профессор",
        },
        {
            name: "В.М. Приходько",
            degree: "чл.-корр. РАН, д-р техн. наук",
            title: "профессор",
        },
        {
            name: "И.С. Содиков",
            degree: "д-р техн. наук",
            title: "профессор Узбекистана",
        },
        {
            name: "Б.Б. Телтаев",
            degree: "академик НАН РК, д-р техн. наук",
            title: "профессор Казахстана",
        },
        {
            name: "Ю.В. Трофименко",
            degree: "д-р техн. наук",
            title: "профессор",
        },
        {
            name: "В.В. Ушаков",
            degree: "д-р техн. наук",
            title: "профессор",
        },
        {
            name: "Л.А. Хвоинский",
            degree: "канд. техн. наук",
        },
        {
            name: "В.А. Ярмолинский",
            degree: "д-р техн. наук",
            title: "профессор",
        },
    ],
}